CLEAR_GOLDS = {
    1700: {
        "gold": 92000,
        "2week_add": None,
    },
    1690: {
        "gold": 86000,
        "2week_add": None,
    },
    1680: {
        "gold": 80500,
        "2week_add": None,
    },
    1670: {
        "gold": 66500,
        "2week_add": 5000,
    },
    1660: {
        "gold": 60000,
        "2week_add": 5000,
    },
    1640: {
        "gold": 52500,
        "2week_add": 8000,
    },
    1630: {
        "gold": 40500,
        "2week_add": 8000,
    },
    1620: {
        "gold": 35000,
        "2week_add": None,
    },
    1610: {
        "gold": 24000,
        "2week_add": None,
    },
    1600: {
        "gold": 18800,
        "2week_add": 800,
    },
    1580: {
        "gold": 13800,
        "2week_add": 2000,
    },
    1560: {
        "gold": 10200,
        "2week_add": 2000,
    },
    1550: {
        "gold": 10200,
        "2week_add": 1600,
    },
    1540: {
        "gold": 10000,
        "2week_add": 1600,
    },
    1520: {
        "gold": 8400,
        "2week_add": 1600,
    },
    1500: {
        "gold": 8400,
        "2week_add": None,
    },
    1490: {
        "gold": 7400,
        "2week_add": None,
    },
    1475: {
        "gold": 7200,
        "2week_add": None,
    },
    1460: {
        "gold": 5200,
        "2week_add": None,
    },
    1445: {
        "gold": 4400,
        "2week_add": None,
    },
    1430: {
        "gold": 3800,
        "2week_add": None,
    },
    1415: {
        "gold": 2200,
        "2week_add": None,
    },
    1370: {
        "gold": 1000,
        "2week_add": None,
    },
}

CLASS_EMOJIS = {
    "환수사": "<:alchemist:1342063214892154920>",
    "아르카나": "<:arcana:1342063256575017041>",
    "바드": "<:bard:1342063266129645578>",
    "배틀마스터": "<:battlemaster:1342063276074205224>",
    "슬레이어": "<:berserker_female:1342063286904033281>",
    "버서커": "<:berserker:1342063295279927307>",
    "블레이드": "<:blade:1342063304725762152>",
    "블래스터": "<:blaster:1342063315052138607>",
    "데모닉": "<:demonic:1342063325818650635>",
    "디스트로이어": "<:destroyer:1342063333078990890>",
    "데빌헌터": "<:devilhunter:1342063341845090425>",
    "소서리스": "<:elemental_master:1342063351542452264>",
    "기공사": "<:force_master:1342063363009679370>",
    "호크아이": "<:hawkeye:1342063379069534238>",
    "건슬링어": "<:gunslinger:1342063395125334056>",
    "홀리나이트": "<:holyknight:1342063406378909737>",
    "브레이커": "<:infighter_male:1342063423315378298>",
    "인파이터": "<:infighter:1342063434094739598>",
    "창술사": "<:lance_master:1342063444249149462>",
    "리퍼": "<:reaper:1342063454021877831>",
    "스카우터": "<:scouter:1342063464633598055>",
    "소울이터": "<:soul_eater:1342063476444627035>",
    "스트라이커": "<:striker:1342063487891017780>",
    "서머너": "<:summoner:1342063498259070986>",
    "워로드": "<:warlord:1342063510041002005>",
    "기상술사": "<:weather_artist:1342063519226658816>",
    "도화가": "<:yinyangshi:1342063529942978650>",
}
